#========================================================================壹
列表

添加新的元素
names.append("")------------>添加到末尾
names.insert(0,"")---------->按照位置添加
names.extend(names2)-------->将names2列表合并到names列表中.注意：extend只能是一个变量


删除元素
names.pop()----------------->删除最后一个
names.remove("")------------>根据内容删除
de names[下标]-------------->根据下标删除


修改
names[下标]----------------->New值


查询
in
not in

#======================================================================贰
字典

增加新的元素
xxx[新的key] = value
xxx.keys() 			#查看dictionary中的key,然后返回所有的key。类型根据版本
xxx.values()			#查看dictionary中的value,然后饭后所有的value。类型根据版本
xxx.keys()          #查询所有的key
xxx.values          #查询所有值value

删除一个元素
del xxx.[key]

修改一个元素
xxx[已存在的ky] = new_balue

查询一个元素
xxx.get(key) //getD()用于出现异常不会报错


字典的方法
#-----------------------------------------------------------------------
name
Out[95]: {'name': '小桃子', 'phone': '100001', 'email': '100001@inf.com'}

In [96]: for A,B in name.items():
    ...:     print("A=%s,B=%s"%(A,B))
    ...:
#打印的结果：
A=name,B=小桃子
A=phone,B=100001
A=email,B=100001@inf.com

#---------------------------------------------------------------------
#拆包
r = (1,2)
a,b = r #分别把元组中值赋值给a，b 两个变量

#--------------------------------------------------------------------
#元组
#查询和列表一样
#注意：元组只能查询，也就是只能读
